In [9]:
# 패키지 임포트
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [10]:
# seaborn 패키지의 titanic 데이터셋을 load 하시오
import seaborn as sns # 그래프 패키지
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 연습문제 1
- 타이타닉 호 승객에 대해서, 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하시오.

- 성별 인원수는 인덱스 기준으로 정렬하고
- 나이별 인원수는 값 기준 정렬
- 그 나머지는 임의 기준 정렬 하시오.

In [11]:
titanic['sex'].value_counts().sort_index()

type(titanic['sex'].value_counts().sort_index())

female    314
male      577
Name: sex, dtype: int64

pandas.core.series.Series

In [12]:
titanic['age'].value_counts().sort_index()
titanic.age.value_counts().sort_index()

0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Name: age, Length: 88, dtype: int64

0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Name: age, Length: 88, dtype: int64

In [13]:
titanic['class'].value_counts().sort_index(ascending=False)
# titanic.class.value_counts().sort_index(ascending=False)
# class는 예약어이므로 ['class'] 접급은 가능하지만
# .class 접근은 불가능

Third     491
Second    184
First     216
Name: class, dtype: int64

In [65]:
# 사망/생존(alive) 인원수
titanic['alive'].value_counts().sort_values(ascending=True)
titanic.alive.value_counts().sort_values(ascending=True)

yes    342
no     549
Name: alive, dtype: int64

yes    342
no     549
Name: alive, dtype: int64

In [16]:
# 제시된 열에 대해 value_counts() 적용시키고 dict에 저장하는 반복문 코드
 
cols = 'sex','age','class','alive'
v_counts={}

for col in cols :
    v_counts[col] = titanic[col].value_counts()
v_counts

{'sex': male      577
 female    314
 Name: sex, dtype: int64,
 'age': 24.00    30
 22.00    27
 18.00    26
 28.00    25
 19.00    25
          ..
 55.50     1
 74.00     1
 0.92      1
 70.50     1
 12.00     1
 Name: age, Length: 88, dtype: int64,
 'class': Third     491
 First     216
 Second    184
 Name: class, dtype: int64,
 'alive': no     549
 yes    342
 Name: alive, dtype: int64}

#### 연습문제 2
- 성별에 따른 생존자수와 사망자수의 정보를 갖고 있는 데이터프레임 titanic_y_n 를 생성하시오
    - 0은 생존 1은 사망

![](데이터조작문제.PNG)

In [17]:
# 생존자 데이터와 사망자 데이터로 분리
yes = titanic[titanic.alive == 'yes']

no = titanic[titanic.alive == 'no']
no.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [68]:
# 사망자 성별 인원 수
no_sex = no.sex.value_counts()
no_sex

male      468
female     81
Name: sex, dtype: int64

In [69]:
# 생존자 성별 인원수
yes_sex = yes.sex.value_counts()
yes_sex

female    233
male      109
Name: sex, dtype: int64

In [70]:
pd.DataFrame([no_sex,yes_sex],index=[0,1])

   male  female
0   468      81
1   109     233

In [71]:
titanic_y_n = pd.DataFrame(titanic.loc[:,['sex','alive']].value_counts())
titanic_y_n

                0
sex    alive
male   no     468
female yes    233
male   yes    109
female no      81

In [72]:
pd.pivot_table(titanic_y_n, index='alive', columns='sex')

           0
sex   female male
alive
no        81  468
yes      233  109

#### 연습문제
- 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
- 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율을 구하시오.
    - bins=[1,15,25,35,60,99]
    - labels=['미성년자','청년','중년','장년','노년']
    - 각 그룹별 비유의 전체 합은 1이 되어야 한다.

In [73]:
yes = titanic[titanic.alive == 'yes']

no = titanic[titanic.alive == 'no']
no.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.25,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True

In [74]:
# 라벨 값 정의
labels = ['미성년자','청년','중년','장년','노년']

# 범위 간격 정의 변수
bins = [1,15,25,35,60,99]

In [75]:
# 범위 유효성 검사 
# bins = [1,15,25,35,60,99]

np.min(no.age)
np.min(yes.age)

np.max(no.age)
np.max(yes.age)

# 실제 data 의 나이가 1살 이하인 승객이 있으므로 범위의 시작을 0으로 변경
bins = [0,15,25,35,60,99]

1.0

0.42

74.0

80.0

In [87]:
# 카테고리 데이터 생성
no['age_cut'] = pd.cut(no['age'], bins,labels=labels)
yes['age_cut'] = pd.cut(yes['age'], bins, labels=labels)

<ipython-input-87-65e0b1c2418d>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  no['age_cut'] = pd.cut(no['age'], bins,labels=labels)
<ipython-input-87-65e0b1c2418d>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  yes['age_cut'] = pd.cut(yes['age'], bins, labels=labels)

In [81]:
no['age_cut'].value_counts(normalize=True) * 100
no['age_cut'].value_counts(normalize=True).sum()

청년      33.726415
장년      27.594340
중년      26.650943
미성년자     8.018868
노년       4.009434
Name: age_cut, dtype: float64

1.0

In [82]:
yes['age_cut'].value_counts(normalize=True) * 100
yes['age_cut'].value_counts(normalize=True).sum()

중년      28.620690
장년      26.896552
청년      25.862069
미성년자    16.896552
노년       1.724138
Name: age_cut, dtype: float64

1.0

#### 연습문제
- ['id_1','id_2','id_3','id_4'] 와 같은 리스트 요소를
- 내포 for문을 이용해서 생성후 리스트로 추가하시오.

In [91]:
# 고정문자열(id_)과 반복 요소(1,2,3,4)를  조합하는 코드를 내포  for문으로 만들어보세요
['id_' + str(i) for i in range(1,5)]

['id_1', 'id_2', 'id_3', 'id_4']